# EditorInteraction Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditorInteraction Constructor
EditorInteraction Class See Also
---
Construct a default interaction.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EditorInteraction()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
EditorInteraction()
```

# See Also
EditorInteraction Class
EditorInteraction Overload
Autodesk.Revit.UI Namespace